$(document).ready(function () {

	var data = [];
    
    
    $('#ceiling').maphilight({ fillColor: 'ffffff' });
	data.alwaysOn = !data.alwaysOn;
	$('#area').data('maphilight', data).trigger('alwaysOn.maphilight');
    
    
    
    
    // Массив с типами жалюзи
    var Types2 = ["vertical", "horizontal", "zebra"];
    // Массив с координатами полигонов
    var Coord2 = [
        // Вертикальные
        ["163,75,165,290,168,329,174,318,174,285,181,285,181,312,184,320,189,310,198,310,207,334,204,352,355,358,353,56", "540,39,546,367,742,379,749,369,754,371,750,18"],
        // Горизонтальные
        ["182,74,386,74,387,417,385,421,181,419,181,350,204,323,217,313,232,307,216,310,196,318,181,331", "429,75,633,75,634,367,429,369"],
        // Зебра
        ["55,68,182,70,180,228,52,226", "229,70,358,71,356,196,309,197,308,239,333,240,334,242,329,244,332,248,324,270,329,278,314,280,309,287,227,287", "404,72,533,208,404,208", "580,73,709,73,708,277,626,275,621,277,610,273,579,271", "341,240,355,240,355,286,351,286,343,277,347,269,340,253,340,247,341,243"]
    ]
    // Массив с категориями тканей
    var Cat2 = [
        // Вертикальные
        ["01", "01", "01", "01", "01", "02", "02", "02", "02", "02", "02", "02", "02", "02", "02", "02", "03", "03", "03", "03", "03", "03", "03", "03", "03", "03", "03", "03", "03", "03", "04", "04", "04", "04", "04", "04", "04", "04", "04", "04", "04", "04", "05", "05", "05", "05", "05", "05", "06", "06", "06", "06"],
        // Горизонтальные
        ["01", "01", "01", "01", "01", "02", "02", "02", "02", "02", "02", "02", "02", "02", "03", "03", "03", "03", "03", "03", "03", "03", "03", "04", "04", "04", "04", "04", "04", "04"],
        // Зебра
        ["01", "01", "01", "01", "01", "02", "02", "02", "02", "02", "02", "02", "02", "02", "03", "03", "03", "03", "03", "03", "03", "03", "03", "04", "04", "04", "04", "04", "04", "04"]
    ];
    // Массив с латинскими названиями
    var NamesLat = [
        // Вертикальные
        ["keln", "lain", "malta", "seul", "disko", "bali", "venera", "zhakkard", "zodiak", "milan", "rein", "rio", "side", "tvist", "yukka", "edem", "avrora", "aruba", "beirut", "venerazoloto", "djangl", "kobra", "modernmetallik", "optima", "rokokko", "savanna", "skazka", "sfera", "eilat", "ratan", "veneratehno", "diana", "zhakkardblack", "zhemchug", "zamsha", "leila", "manila", "ofelia", "officeblack", "sideblack", "sendi", "shelk", "zhemchugblack", "skrin", "skrin2", "putsamuraya", "chainayaceremonia", "chiochiosan", "studio", "flora", "sutra", "krit"], 
        // Горизонтальные
        ["naz 1", "naz 2", "naz 3"],
        // Зебра
        ["len", "kristall", "soft", "step", "standart", "arabeska", "babochki", "dakota", "kofe", "montana", "silujet", "tetris", "jellada", "jetnik", "adazhio", "damask", "mellanzh", "metallik", "ornament", "palas", "fleks", "frost", "jelektra", "ajlend", "valensija", "dajkiri", "kletka", "luksortrio", "luksoruno", "parma"]
    ];
    // Массив с русскими названиями
    var NamesRus = [
        // Вертикальные
        ["Кельн", "Лайн", "Мальта", "Сеул", "Диско", "Бали", "Венера", "Жаккард №1", "Зодиак", "Милан", "Рейн", "Рио", "Сиде", "Твист", "Юкка", "Эдем", "Аврора", "Аруба", "Бейрут", "Венера, золото-серебро", "Джангл", "Кобра", "Модерн металлик", "Оптима", "Рококко", "Саванна", "Сказка", "Сфера", "Эйлат", "Ратан", "Венера Техно", "Диана", "Жаккард Black-out", "Жемчуг", "Замша", "Лейла", "Манила", "Офелия", "Офис Black-out", "Сиде Black-out", "Сэнди", "Шелк", "Жемчуг Black-out", "Скрин", "Скрин 2", "Путь самурая", "Чайная церемония", "Чио-чио-сан", "Студио", "Флора", "Сутра", "Крит"], 
        // Горизонтальные
        ["Название 1", "Название 2"],
        // Зебра
        ["Лен", "Кристалл", "Софт", "Степ", "Стандарт", "Арабеска", "Бабочки", "Дакота", "Кофе", "Монтана", "Силуэт", "Тетрис", "Эллада", "Этник", "Адажио", "Дамаск", "Мелланж", "Металлик", "Орнамент", "Палас", "Флекс", "Фрост", "Электра", "Айленд", "Валенсия", "Дайкири", "Клетка", "Луксор трио", "Луксор уно", "Парма"]
    ];
    // Массив с текстурами тканей
    var Colors2 = [
        // Вертикальные
        [
            // Кельн
            ["0225", "2261", "3204", "4077", "4201", "4221", "5102", "5260", "5501", "5713"],
            // Лайн
            ["0225", "1608", "1851", "2261", "2406", "2868", "3204", "3210", "3499", "4077", "4082", "4221", "4264", "4454", "5102", "5252", "5302", "5501", "5608", "5850", "5880", "5992"],
            // Мальта
            ["0225", "1608", "2259", "2840", "3465", "4082", "4221", "4240", "5102", "5850", "5992"],
            // Сеул
            ["0225", "2261", "4221", "5102", "5501"],
            // Диско
            ["0225", "2261", "3465", "3499", "4240", "4264", "4454"],
            // Бали
            ["0225", "2261", "2746", "2871", "3499", "4059", "4096", "4201", "4210", "4290", "4454", "4803", "5102", "5173", "5253", "5302", "5612", "5713", "5850", "5992", "7013"],
            // Венера
            ["0225", "1608", "2406", "2746", "4059", "4120", "4240", "4803", "5992", "7005", "7125"],
            // Жаккард №1
            ["0225", "2261", "2868", "4240"],
            // Зодиак
            ["0225", "2261", "4059", "4803", "5501"],
            // Милан
            ["0225", "4082", "4221", "5992"],
            // Рейн
            ["0225", "2802", "2870", "3209", "4240", "4264", "5501"],
            // Рио
            ["0225", "2746", "2840", "2854", "2871", "3465", "4077", "4210", "4221", "4240", "4290", "4454", "4824", "5173", "5470", "5921", "5992"],
            // Сиде
            ["0225", "1608", "2406", "2865", "3465", "4300", "4454", "4803", "4858", "5252", "5586"],
            // Твист
            ["0225", "1608", "1908", "2259", "4210", "4221", "4240", "5992"],
            // Юкка
            ["0000"],
            // Эдем
            ["0225", "4803", "5608"],
            // Аврора
            ["0225", "2261", "4059", "4221", "5173", "5850"],
            // Аруба
            ["2406", "2746"],
            // Бейрут
            ["0225", "2261", "4059"],
            // Венера золото-серебро
            ["0000"],
            // Джангл
            ["0225", "2261", "4082", "5102", "5850", "7013", "7125", "7128", "7256", "7282"],
            // Кобра
            ["7013", "7125"],
            // Модерн металлик
            ["7013", "7125", "7128", "7256"],
            // Оптима
            ["2261", "2406", "2746", "4120", "5252", "5501", "5540"],
            // Рококко
            ["1881", "2406", "2746", "2870", "4454", "4803"],
            // Саванна
            ["0000"],
            // Сказка
            ["0225", "1608", "1881", "2261", "2868", "4210", "4290"],
            // Сфера
            ["0225", "1608", "2261", "2406", "2746", "2868", "2870", "2872", "3210", "4059", "4290", "5252", "5540", "5850"],
            // Эйлат
            ["0225", "2406"],
            // Ратан
            ["0225", "2261"],
            
        ],
        // Горизонтальные
        [
            ["0225", "2261", "4077", "4290", "4824"],
            ["0005, 0006, 0007"],
            ["0008, 0009, 0010"]
        ],
        //Зебра
        [
            // Лен
            ["2261"],
            // Кристалл
            ["0225", "2261", "4077", "4290", "4824"],
            // Софт
            ["0225", "2406", "2552", "2868", "3144", "3210", "4264", "4290"],
            // Степ
            ["1852", "2406"],
            // Стандарт
            ["0225", "2259", "2840", "2870", "4096", "4210", "4240", "4453", "4824", "5102", "5850", "5992"],
        ],
    ];
    
    
    
    var vType, vName, vCount, vColor, vHeight, vWidth, vPrice;
    
    
    
    $('#t-select-2').on('change', function(){
        for (i in Types2) {
            switch($(this).val()){
                case Types2[i]:
                    $('#f-select').empty();
                    $('#f-select').css('display','block');
                    $('#map-photo').empty();
                    $('#color_factura').empty();
                    $('#color_factura').css('display','none');
                    $('#factura-label').css('display','none');
                    for (k in Coord2) {
                        $('#map-photo').append('<area id="area-'+[k]+'" shape="POLYGON" coords="'+Coord2[i][k]+'" nohref="">');
                    }
                    $('#room_color_fon').attr('src','img/'+Types2[i]+'.png');
                    $('#f-select').append('<option value="nothing">Выберите ткань</option>');
                    for (j in NamesLat[i]) {
                        $('#f-select').append('<option class="'+Cat2[i][j]+'" value="'+NamesLat[i][j]+'">'+NamesRus[i][j]+'</option>');
                    };
                    vType = Types2[i];
                    vCount = $.inArray(Types2[i], Types2);
                break;
                case "nothing":
                    $('#f-select').empty();
                    $('#f-select').css('display','none');
                    $('#map-photo').empty();
                    $('#color_factura').empty();
                    $('#color_factura').css('display','none');
                    $('#factura-label').css('display','none');
                break;
            };
        };
    });
    
    $('#f-select').on('change', function(){
        for (i in NamesLat[vCount]) {
            switch($(this).val()){
                case NamesLat[vCount][i]:
                    $('#color_factura').css('display','none');
                    $('#factura-label').css('display','none');
                    $('#color_factura').empty();
                    $('#factura-label').css('display','block');
                    for (j in Colors2[vCount][i]) {
                        $('#color_factura').css('display','block');
                        $('#color_factura').append('<span style="background-image:url(../../img/'+Types2[vCount]+'/'+NamesLat[vCount][i]+'/'+Colors2[vCount][i][j]+'.jpg)" class="'+Colors2[vCount][i][j]+'"></span>');                        
                    };
                    $('#color_factura').append('<div class="cl"></div>');
                    vName = NamesLat[vCount][i];
                break;
                case "nothing":
                    $('#color_factura').empty();
                    $('#color_factura').css('display','none');
                    $('#factura-label').css('display','none');
                break;
            };
        };
        
        $("#input_color .input_color_ceiling span").click(function(){
            vColor = $(this).attr("class");
            $('#ceiling').css('background-image','url("../../img/'+vType+'/'+vName+'/'+vColor+'.jpg")');
            $('#ceiling').css('opacity','1');
            $('#factura').css('opacity','1');
            $('#factura').css('background-image','url("../../img/'+vType+'/'+vName+'/'+vColor+'.jpg")');
            $('#area-0').data('maphilight', data).trigger('alwaysOn.maphilight');
            $('#area-1').data('maphilight', data).trigger('alwaysOn.maphilight');
            $('#area-2').data('maphilight', data).trigger('alwaysOn.maphilight');
            $('#area-3').data('maphilight', data).trigger('alwaysOn.maphilight');
            $('#area-4').data('maphilight', data).trigger('alwaysOn.maphilight');
            $('#area-5').data('maphilight', data).trigger('alwaysOn.maphilight');
            $('#area-6').data('maphilight', data).trigger('alwaysOn.maphilight');
        });
        
    });
    
    $('#calculate').on('click', function(){

    });
    
});

    
    
